#                   Reading and Writing Csv File
## 1) Read Csv
## 2) Write Csv
## 3) Read Excel
## 4) Write Excel

In [1]:
import pandas as pd

In [2]:
df  = pd.read_csv('stock_data.csv')

In [3]:
df

                                             Stock
tickers eps           revenue price         people
GOOGL   27.82         87      845       larry page
WMT     4.61          484     65              n.a.
MSFT    -1            85      64        bill gates
RIL     not available 50      1023   mukesh ambani
TATA    5.6           -1      n.a.      ratan tata

In [4]:
df

                                             Stock
tickers eps           revenue price         people
GOOGL   27.82         87      845       larry page
WMT     4.61          484     65              n.a.
MSFT    -1            85      64        bill gates
RIL     not available 50      1023   mukesh ambani
TATA    5.6           -1      n.a.      ratan tata

In [5]:
df

                                             Stock
tickers eps           revenue price         people
GOOGL   27.82         87      845       larry page
WMT     4.61          484     65              n.a.
MSFT    -1            85      64        bill gates
RIL     not available 50      1023   mukesh ambani
TATA    5.6           -1      n.a.      ratan tata

In [6]:
# here if we want to read data after 1st rows

In [13]:
df = pd.read_csv('stock_data.csv', skiprows=1)#or
df = pd.read_csv('stock_data.csv', header=1) # index start from 0 hence header =1 meand row 2 in csv

In [14]:
df

  tickers            eps  revenue price         people
0   GOOGL          27.82       87   845     larry page
1     WMT           4.61      484    65           n.a.
2    MSFT             -1       85    64     bill gates
3    RIL   not available       50  1023  mukesh ambani
4    TATA            5.6       -1  n.a.     ratan tata

In [15]:
# now let us look scenario when there is no header 

df1 = pd.read_csv('stock_data.csv')

In [16]:
df1

  GOOGL          27.82   87   845     larry page
0   WMT           4.61  484    65           n.a.
1  MSFT             -1   85    64     bill gates
2  RIL   not available   50  1023  mukesh ambani
3  TATA            5.6   -1  n.a.     ratan tata

In [17]:
df1 = pd.read_csv('stock_data.csv', header=None)

In [18]:
df1

       0              1    2     3              4
0  GOOGL          27.82   87   845     larry page
1    WMT           4.61  484    65           n.a.
2   MSFT             -1   85    64     bill gates
3   RIL   not available   50  1023  mukesh ambani
4   TATA            5.6   -1  n.a.     ratan tata

In [20]:
#instead of 0,1,2,3,4 we can provide name also
df1 = pd.read_csv('stock_data.csv', header=None, names = ['tickers','eps', 'revenue', 'pice', 'people'])

In [21]:
df1

  tickers            eps  revenue  pice         people
0   GOOGL          27.82       87   845     larry page
1     WMT           4.61      484    65           n.a.
2    MSFT             -1       85    64     bill gates
3    RIL   not available       50  1023  mukesh ambani
4    TATA            5.6       -1  n.a.     ratan tata

In [22]:
# let us say we have to select only 3 rows

In [28]:
df1 = pd.read_csv('stock_data1.csv')

In [29]:
df1

  tickers            eps  revenue price         people
0   GOOGL          27.82       87   845     larry page
1     WMT           4.61      484    65           n.a.
2    MSFT             -1       85    64     bill gates
3    RIL   not available       50  1023  mukesh ambani
4    TATA            5.6       -1  n.a.     ratan tata

In [30]:
df1 = pd.read_csv('stock_data1.csv', nrows = 3)

#

In [31]:
df1

  tickers    eps  revenue  price      people
0   GOOGL  27.82       87    845  larry page
1     WMT   4.61      484     65        n.a.
2    MSFT  -1.00       85     64  bill gates

In [32]:
#Cleanup messy data from file 'not available','na'

In [33]:
df2  = pd.read_csv('stock_data1.csv', na_values=['not available', 'n.a.']) # it will replace all missing data with NAN

In [34]:
df2

  tickers    eps  revenue   price         people
0   GOOGL  27.82       87   845.0     larry page
1     WMT   4.61      484    65.0            NaN
2    MSFT  -1.00       85    64.0     bill gates
3    RIL     NaN       50  1023.0  mukesh ambani
4    TATA   5.60       -1     NaN     ratan tata

In [35]:
# here in revenue column we can see that there is revenue -1 , revenue cannot be -1, so we have to replace -1 alos with NAN

In [38]:
df3  = pd.read_csv('stock_data1.csv', na_values={ 'eps':['not available', 'n.a.'],
                                                'revenue':['not available', 'n.a.', -1],
                                                 'price':['not available', 'n.a.'],
                                                 'people':['not available', 'n.a.']})

In [39]:
df3

  tickers    eps  revenue   price         people
0   GOOGL  27.82     87.0   845.0     larry page
1     WMT   4.61    484.0    65.0            NaN
2    MSFT  -1.00     85.0    64.0     bill gates
3    RIL     NaN     50.0  1023.0  mukesh ambani
4    TATA   5.60      NaN     NaN     ratan tata

In [40]:
df3.to_csv('new_csv')# it will create new csv file with index

In [43]:
df3.to_csv('new_csv', index=False)# it will craete new csv file without any index

In [44]:
# let say our requirement is to export only two columns

In [45]:
df3.columns

Index(['tickers', 'eps', 'revenue', 'price', 'people'], dtype='object')

In [46]:
df3.to_csv('new1_csv', columns=['tickers','eps'])

In [47]:
# if u want to skip header

In [50]:
df3.to_csv('new2_csv', header=False)

In [54]:
data  = pd.read_excel('stock_data.xlsx')

In [55]:
data

     stock     Unnamed: 1 Unnamed: 2 Unnamed: 3     Unnamed: 4
0  tickers            eps    revenue      price         people
1    GOOGL          27.82         87        845     larry page
2      WMT           4.61        484         65           n.a.
3     MSFT             -1         85         64     bill gates
4     RIL   not available         50       1023  mukesh ambani
5     TATA            5.6         -1       n.a.     ratan tata

In [56]:
data  = pd.read_excel('stock_data.xlsx', skiprows=1)

In [57]:
data

  tickers            eps  revenue price         people
0   GOOGL          27.82       87   845     larry page
1     WMT           4.61      484    65           n.a.
2    MSFT             -1       85    64     bill gates
3    RIL   not available       50  1023  mukesh ambani
4    TATA            5.6       -1  n.a.     ratan tata

In [58]:
def conver(cell):
    if cell == 'n.a.':
        return 'sam walton'
    else:
        return cell

In [61]:
data  = pd.read_excel('stock_data.xlsx', skiprows=1, converters= {'people':conver})# here on people column , conver function will be apply

In [62]:
data

  tickers            eps  revenue price         people
0   GOOGL          27.82       87   845     larry page
1     WMT           4.61      484    65     sam walton
2    MSFT             -1       85    64     bill gates
3    RIL   not available       50  1023  mukesh ambani
4    TATA            5.6       -1  n.a.     ratan tata

In [63]:
data.to_excel('new2.xls', sheet_name='stocks')

In [65]:
data.to_excel('new2.xls', sheet_name='stocks', startrow=1, startcol=2, index=False)